Tekla Open API Reference for Tekla Structures 2025
IEvents.DrawingChanged Event
 The DrawingChanged event is raised when the drawing has been changed and the database is committed.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.DrawingStatusChangedDelegate DrawingChanged
Event DrawingChanged As Events.DrawingStatusChangedDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingStatusChangedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Drawing Namespace